---
type: RibbonItemEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# RibbonItemEventArgs

`Autodesk.Revit.UI.Events.RibbonItemEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RibbonItemEventArgs | — | `public RibbonItemEventArgs ()` |
| Property | Application | — | `public UIApplication Application { get ; }` |